app/controllers/api/v1/albums_controller.rb

INSERT INTO "albums" ("name", "playcount", "image", "url", "artistId") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "albums".* FROM "albums" WHERE "albums"."name" = $1 AND "albums"."image" = $2 AND "albums"."playcount" = $3 AND "albums"."url" = $4 AND "albums"."artistId" = $5 LIMIT $6
---
  def create
    @album = Album.find_or_create_by(
      name: params['name'],
      image: params['image'][3]['#text'],
      playcount: params['playcount'],
      url: params['url'],
      artistId: params['artist']['mbid'],
    )