app/controllers/api/v1/artists_controller.rb

  def create
    @artist = Artist.find_or_create_by(
      name: params['name'],
      image: params['image'][3]['#text'],
      listeners: params['listeners'],
      playcount: params['playcount'],
      url: params['url'],
      bio: params['summary'],
      mbid: params['mbid'],
    )
---
INSERT INTO "artists" ("name", "listeners", "playcount", "url", "mbid") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Eminem"], ["listeners", 4460059], ["playcount", 192677383], ["url", "https://www.last.fm/music/Eminem"], ["mbid", "b95ce3ff-3d05-4e87-9e01-c97b66af13d4"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = $1 AND "artists"."image" = $2 AND "artists"."listeners" = $3 AND "artists"."playcount" = $4 AND "artists"."url" = $5 AND "artists"."mbid" = $6 LIMIT $7

  def destroy
    @artist = Artist.destroy(params[:id])
    @artists = Artist.all
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 7]]
SELECT "artists".* FROM "artists"